apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_fcfg1.h
/* FCFG1 Register Register Addresses ********************************************************************************/

#define TIVA_FCFG1_MISC_CONF_1                             (TIVA_FCFG1_BASE + TIVA_FCFG1_MISC_CONF_1_OFFSET)
#define TIVA_FCFG1_MISC_CONF_2                             (TIVA_FCFG1_BASE + TIVA_FCFG1_MISC_CONF_2_OFFSET)
#define TIVA_FCFG1_CONFIG_CC26_FE                          (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_CC26_FE_OFFSET)
#define TIVA_FCFG1_CONFIG_CC13_FE                          (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_CC13_FE_OFFSET)
#define TIVA_FCFG1_CONFIG_RF_COMMON                        (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_RF_COMMON_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4              (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4              (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV2_CC26_1G               (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV2_CC13_1G               (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV4_CC26                  (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV4_CC26_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV4_CC13                  (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV4_CC13_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV5                       (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV5_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV6_CC26                  (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV6_CC26_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV6_CC13                  (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV6_CC13_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV10                      (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV10_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV12_CC26                 (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV12_CC26_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV12_CC13                 (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV12_CC13_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV15                      (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV15_OFFSET)
#define TIVA_FCFG1_CONFIG_SYNTH_DIV30                      (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_SYNTH_DIV30_OFFSET)
#define TIVA_FCFG1_FLASH_NUMBER                            (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_NUMBER_OFFSET)
#define TIVA_FCFG1_FLASH_COORDINATE                        (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_COORDINATE_OFFSET)
#define TIVA_FCFG1_FLASH_E_P                               (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_E_P_OFFSET)
#define TIVA_FCFG1_FLASH_C_E_P_R                           (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_C_E_P_R_OFFSET)
#define TIVA_FCFG1_FLASH_P_R_PV                            (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_P_R_PV_OFFSET)
#define TIVA_FCFG1_FLASH_EH_SEQ                            (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_EH_SEQ_OFFSET)
#define TIVA_FCFG1_FLASH_VHV_E                             (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_VHV_E_OFFSET)
#define TIVA_FCFG1_FLASH_PP                                (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_PP_OFFSET)
#define TIVA_FCFG1_FLASH_PROG_EP                           (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_PROG_EP_OFFSET)
#define TIVA_FCFG1_FLASH_ERA_PW                            (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_ERA_PW_OFFSET)
#define TIVA_FCFG1_FLASH_VHV                               (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_VHV_OFFSET)
#define TIVA_FCFG1_FLASH_VHV_PV                            (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_VHV_PV_OFFSET)
#define TIVA_FCFG1_FLASH_V                                 (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_V_OFFSET)
#define TIVA_FCFG1_USER_ID                                 (TIVA_FCFG1_BASE + TIVA_FCFG1_USER_ID_OFFSET)
#define TIVA_FCFG1_FLASH_OTP_DATA3                         (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_OTP_DATA3_OFFSET)
#define TIVA_FCFG1_ANA2_TRIM                               (TIVA_FCFG1_BASE + TIVA_FCFG1_ANA2_TRIM_OFFSET)
#define TIVA_FCFG1_LDO_TRIM                                (TIVA_FCFG1_BASE + TIVA_FCFG1_LDO_TRIM_OFFSET)
#define TIVA_FCFG1_MAC_BLE_0                               (TIVA_FCFG1_BASE + TIVA_FCFG1_MAC_BLE_0_OFFSET)
#define TIVA_FCFG1_MAC_BLE_1                               (TIVA_FCFG1_BASE + TIVA_FCFG1_MAC_BLE_1_OFFSET)
#define TIVA_FCFG1_MAC_15_4_0                              (TIVA_FCFG1_BASE + TIVA_FCFG1_MAC_15_4_0_OFFSET)
#define TIVA_FCFG1_MAC_15_4_1                              (TIVA_FCFG1_BASE + TIVA_FCFG1_MAC_15_4_1_OFFSET)
#define TIVA_FCFG1_FLASH_OTP_DATA4                         (TIVA_FCFG1_BASE + TIVA_FCFG1_FLASH_OTP_DATA4_OFFSET)
#define TIVA_FCFG1_MISC_TRIM                               (TIVA_FCFG1_BASE + TIVA_FCFG1_MISC_TRIM_OFFSET)
#define TIVA_FCFG1_RCOSC_HF_TEMPCOMP                       (TIVA_FCFG1_BASE + TIVA_FCFG1_RCOSC_HF_TEMPCOMP_OFFSET)
#define TIVA_FCFG1_ICEPICK_DEVICE_ID                       (TIVA_FCFG1_BASE + TIVA_FCFG1_ICEPICK_DEVICE_ID_OFFSET)
#define TIVA_FCFG1_FCFG1_REVISION                          (TIVA_FCFG1_BASE + TIVA_FCFG1_FCFG1_REVISION_OFFSET)
#define TIVA_FCFG1_MISC_OTP_DATA                           (TIVA_FCFG1_BASE + TIVA_FCFG1_MISC_OTP_DATA_OFFSET)
#define TIVA_FCFG1_IOCONF                                  (TIVA_FCFG1_BASE + TIVA_FCFG1_IOCONF_OFFSET)
#define TIVA_FCFG1_CONFIG_IF_ADC                           (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_IF_ADC_OFFSET)
#define TIVA_FCFG1_CONFIG_OSC_TOP                          (TIVA_FCFG1_BASE + TIVA_FCFG1_CONFIG_OSC_TOP_OFFSET)
#define TIVA_FCFG1_SOC_ADC_ABS_GAIN                        (TIVA_FCFG1_BASE + TIVA_FCFG1_SOC_ADC_ABS_GAIN_OFFSET)
#define TIVA_FCFG1_SOC_ADC_REL_GAIN                        (TIVA_FCFG1_BASE + TIVA_FCFG1_SOC_ADC_REL_GAIN_OFFSET)
#define TIVA_FCFG1_SOC_ADC_OFFSET_INT                      (TIVA_FCFG1_BASE + TIVA_FCFG1_SOC_ADC_OFFSET_INT_OFFSET)
#define TIVA_FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT         (TIVA_FCFG1_BASE + TIVA_FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_OFFSET)
#define TIVA_FCFG1_AMPCOMP_TH1                             (TIVA_FCFG1_BASE + TIVA_FCFG1_AMPCOMP_TH1_OFFSET)
#define TIVA_FCFG1_AMPCOMP_TH2                             (TIVA_FCFG1_BASE + TIVA_FCFG1_AMPCOMP_TH2_OFFSET)
#define TIVA_FCFG1_AMPCOMP_CTRL1                           (TIVA_FCFG1_BASE + TIVA_FCFG1_AMPCOMP_CTRL1_OFFSET)
#define TIVA_FCFG1_ANABYPASS_VALUE2                        (TIVA_FCFG1_BASE + TIVA_FCFG1_ANABYPASS_VALUE2_OFFSET)
#define TIVA_FCFG1_VOLT_TRIM                               (TIVA_FCFG1_BASE + TIVA_FCFG1_VOLT_TRIM_OFFSET)
#define TIVA_FCFG1_OSC_CONF                                (TIVA_FCFG1_BASE + TIVA_FCFG1_OSC_CONF_OFFSET)
#define TIVA_FCFG1_FREQ_OFFSET                             (TIVA_FCFG1_BASE + TIVA_FCFG1_FREQ_OFFSET_OFFSET)
#define TIVA_FCFG1_MISC_OTP_DATA_1                         (TIVA_FCFG1_BASE + TIVA_FCFG1_MISC_OTP_DATA_1_OFFSET)
#define TIVA_FCFG1_PWD_CURR_20C                            (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_20C_OFFSET)
#define TIVA_FCFG1_PWD_CURR_35C                            (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_35C_OFFSET)
#define TIVA_FCFG1_PWD_CURR_50C                            (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_50C_OFFSET)
#define TIVA_FCFG1_PWD_CURR_65C                            (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_65C_OFFSET)
#define TIVA_FCFG1_PWD_CURR_80C                            (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_80C_OFFSET)
#define TIVA_FCFG1_PWD_CURR_95C                            (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_95C_OFFSET)
#define TIVA_FCFG1_PWD_CURR_110C                           (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_110C_OFFSET)
#define TIVA_FCFG1_PWD_CURR_125C                           (TIVA_FCFG1_BASE + TIVA_FCFG1_PWD_CURR_125C_OFFSET)
#define TIVA_FCFG1_SHDW_DIE_ID_0                           (TIVA_FCFG1_BASE + TIVA_FCFG1_SHDW_DIE_ID_0_OFFSET)
#define TIVA_FCFG1_SHDW_DIE_ID_1                           (TIVA_FCFG1_BASE + TIVA_FCFG1_SHDW_DIE_ID_1_OFFSET)
#define TIVA_FCFG1_SHDW_DIE_ID_2                           (TIVA_FCFG1_BASE + TIVA_FCFG1_SHDW_DIE_ID_2_OFFSET)
#define TIVA_FCFG1_SHDW_DIE_ID_3                           (TIVA_FCFG1_BASE + TIVA_FCFG1_SHDW_DIE_ID_3_OFFSET)
#define TIVA_FCFG1_SHDW_OSC_BIAS_LDO_TRIM                  (TIVA_FCFG1_BASE + TIVA_FCFG1_SHDW_OSC_BIAS_LDO_TRIM_OFFSET)
#define TIVA_FCFG1_SHDW_ANA_TRIM                           (TIVA_FCFG1_BASE + TIVA_FCFG1_SHDW_ANA_TRIM_OFFSET)
#define TIVA_FCFG1_DAC_BIAS_CNF                            (TIVA_FCFG1_BASE + TIVA_FCFG1_DAC_BIAS_CNF_OFFSET)
#define TIVA_FCFG1_TFW_PROBE                               (TIVA_FCFG1_BASE + TIVA_FCFG1_TFW_PROBE_OFFSET)
#define TIVA_FCFG1_TFW_FT                                  (TIVA_FCFG1_BASE + TIVA_FCFG1_TFW_FT_OFFSET)
#define TIVA_FCFG1_DAC_CAL0                                (TIVA_FCFG1_BASE + TIVA_FCFG1_DAC_CAL0_OFFSET)
#define TIVA_FCFG1_DAC_CAL1                                (TIVA_FCFG1_BASE + TIVA_FCFG1_DAC_CAL1_OFFSET)
#define TIVA_FCFG1_DAC_CAL2                                (TIVA_FCFG1_BASE + TIVA_FCFG1_DAC_CAL2_OFFSET)
#define TIVA_FCFG1_DAC_CAL3                                (TIVA_FCFG1_BASE + TIVA_FCFG1_DAC_CAL3_OFFSET)

