apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_fcfg1.h
/* FCFG1 Bitfield Definitions ***************************************************************************************/

/* TIVA_FCFG1_MISC_CONF_1 */

#define FCFG1_MISC_CONF_1_DEVICE_MINOR_REV_SHIFT           (0)        /* Bits 0-7: HW minor revision number */
#define FCFG1_MISC_CONF_1_DEVICE_MINOR_REV_MASK            (0xff << FCFG1_MISC_CONF_1_DEVICE_MINOR_REV_SHIFT)
#  define FCFG1_MISC_CONF_1_DEVICE_MINOR_REV(n)            ((uint32_t)(n) << FCFG1_MISC_CONF_1_DEVICE_MINOR_REV_SHIFT)

/* TIVA_FCFG1_MISC_CONF_2 */

#define FCFG1_MISC_CONF_2_HPOSC_COMP_P3_SHIFT              (0)        /* Bits 0-7 */
#define FCFG1_MISC_CONF_2_HPOSC_COMP_P3_MASK               (0xff << FCFG1_MISC_CONF_2_HPOSC_COMP_P3_SHIFT)
#  define FCFG1_MISC_CONF_2_HPOSC_COMP_P3(n)               ((uint32_t)(n) << FCFG1_MISC_CONF_2_HPOSC_COMP_P3_SHIFT)

/* TIVA_FCFG1_CONFIG_CC26_FE */

#define FCFG1_CONFIG_CC26_FE_RSSI_OFFSET_SHIFT             (0)        /* Bits 0-7 */
#define FCFG1_CONFIG_CC26_FE_RSSI_OFFSET_MASK              (0xff << FCFG1_CONFIG_CC26_FE_RSSI_OFFSET_SHIFT)
#  define FCFG1_CONFIG_CC26_FE_RSSI_OFFSET(n)              ((uint32_t)(n) << FCFG1_CONFIG_CC26_FE_RSSI_OFFSET_SHIFT)
#define FCFG1_CONFIG_CC26_FE_RSSITRIMCOMPLETE_N            (1 << 12)  /* Bit 12 */
#define FCFG1_CONFIG_CC26_FE_PATRIMCOMPLETE_N              (1 << 13)  /* Bit 13 */
#define FCFG1_CONFIG_CC26_FE_CTL_PA0_TRIM_SHIFT            (14)       /* Bits 14-18 */
#define FCFG1_CONFIG_CC26_FE_CTL_PA0_TRIM_MASK             (31 << FCFG1_CONFIG_CC26_FE_CTL_PA0_TRIM_SHIFT)
#  define FCFG1_CONFIG_CC26_FE_CTL_PA0_TRIM(n)             ((uint32_t)(n) << FCFG1_CONFIG_CC26_FE_CTL_PA0_TRIM_SHIFT)
#define FCFG1_CONFIG_CC26_FE_IFAMP_TRIM_SHIFT              (19)       /* Bits 19-23 */
#define FCFG1_CONFIG_CC26_FE_IFAMP_TRIM_MASK               (31 << FCFG1_CONFIG_CC26_FE_IFAMP_TRIM_SHIFT)
#  define FCFG1_CONFIG_CC26_FE_IFAMP_TRIM(n)               ((uint32_t)(n) << FCFG1_CONFIG_CC26_FE_IFAMP_TRIM_SHIFT)
#define FCFG1_CONFIG_CC26_FE_LNA_IB_SHIFT                  (24)       /* Bits 24-27 */
#define FCFG1_CONFIG_CC26_FE_LNA_IB_MASK                   (15 << FCFG1_CONFIG_CC26_FE_LNA_IB_SHIFT)
#  define FCFG1_CONFIG_CC26_FE_LNA_IB(n)                   ((uint32_t)(n) << FCFG1_CONFIG_CC26_FE_LNA_IB_SHIFT)
#define FCFG1_CONFIG_CC26_FE_IFAMP_IB_SHIFT                (28)       /* Bits 28-31  */
#define FCFG1_CONFIG_CC26_FE_IFAMP_IB_MASK                 (15 << FCFG1_CONFIG_CC26_FE_IFAMP_IB_SHIFT)
#  define FCFG1_CONFIG_CC26_FE_IFAMP_IB(n)                 ((uint32_t)(n) << FCFG1_CONFIG_CC26_FE_IFAMP_IB_SHIFT)

/* TIVA_FCFG1_CONFIG_CC13_FE */

#define FCFG1_CONFIG_CC13_FE_RSSI_OFFSET_SHIFT             (0)      /* Bits 0-7 */
#define FCFG1_CONFIG_CC13_FE_RSSI_OFFSET_MASK              (0xff << FCFG1_CONFIG_CC13_FE_RSSI_OFFSET_SHIFT)
#  define FCFG1_CONFIG_CC13_FE_RSSI_OFFSET(n)              ((uint32_t)(n) << FCFG1_CONFIG_CC13_FE_RSSI_OFFSET_SHIFT)
#define FCFG1_CONFIG_CC13_FE_RSSITRIMCOMPLETE_N            (1 << 12)  /* Bit 12 */
#define FCFG1_CONFIG_CC13_FE_PATRIMCOMPLETE_N              (1 << 13)  /* Bit 13 */
#define FCFG1_CONFIG_CC13_FE_CTL_PA0_TRIM_SHIFT            (14)      /* Bits 14-18 */
#define FCFG1_CONFIG_CC13_FE_CTL_PA0_TRIM_MASK             (31 << FCFG1_CONFIG_CC13_FE_CTL_PA0_TRIM_SHIFT)
#  define FCFG1_CONFIG_CC13_FE_CTL_PA0_TRIM(n)             ((uint32_t)(n) << FCFG1_CONFIG_CC13_FE_CTL_PA0_TRIM_SHIFT)
#define FCFG1_CONFIG_CC13_FE_IFAMP_TRIM_SHIFT              (19)      /* Bits 19-23 */
#define FCFG1_CONFIG_CC13_FE_IFAMP_TRIM_MASK               (31 << FCFG1_CONFIG_CC13_FE_IFAMP_TRIM_SHIFT)
#  define FCFG1_CONFIG_CC13_FE_IFAMP_TRIM(n)               ((uint32_t)(n) << FCFG1_CONFIG_CC13_FE_IFAMP_TRIM_SHIFT)
#define FCFG1_CONFIG_CC13_FE_LNA_IB_SHIFT                  (24)      /* Bits 24-27 */
#define FCFG1_CONFIG_CC13_FE_LNA_IB_MASK                   (15 << FCFG1_CONFIG_CC13_FE_LNA_IB_SHIFT)
#  define FCFG1_CONFIG_CC13_FE_LNA_IB(n)                   ((uint32_t)(n) << FCFG1_CONFIG_CC13_FE_LNA_IB_SHIFT)
#define FCFG1_CONFIG_CC13_FE_IFAMP_IB_SHIFT                (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_CC13_FE_IFAMP_IB_MASK                 (15 << FCFG1_CONFIG_CC13_FE_IFAMP_IB_SHIFT)
#  define FCFG1_CONFIG_CC13_FE_IFAMP_IB(n)                 ((uint32_t)(n) << FCFG1_CONFIG_CC13_FE_IFAMP_IB_SHIFT)

/* TIVA_FCFG1_CONFIG_RF_COMMON */

#define FCFG1_CONFIG_RF_COMMON_DACTRIM_SHIFT               (0)      /* Bits 0-5 */
#define FCFG1_CONFIG_RF_COMMON_DACTRIM_MASK                (0x3f << FCFG1_CONFIG_RF_COMMON_DACTRIM_SHIFT)
#  define FCFG1_CONFIG_RF_COMMON_DACTRIM(n)                ((uint32_t)(n) << FCFG1_CONFIG_RF_COMMON_DACTRIM_SHIFT)
#define FCFG1_CONFIG_RF_COMMON_QUANTCTLTHRES_SHIFT         (6)      /* Bits 6-8 */
#define FCFG1_CONFIG_RF_COMMON_QUANTCTLTHRES_MASK          (7 << FCFG1_CONFIG_RF_COMMON_QUANTCTLTHRES_SHIFT)
#  define FCFG1_CONFIG_RF_COMMON_QUANTCTLTHRES(n)          ((uint32_t)(n) << FCFG1_CONFIG_RF_COMMON_QUANTCTLTHRES_SHIFT)
#define FCFG1_CONFIG_RF_COMMON_RFLDO_TRIM_OUTPUT_SHIFT     (9)      /* Bits 9-15 */
#define FCFG1_CONFIG_RF_COMMON_RFLDO_TRIM_OUTPUT_MASK      (0x7f << FCFG1_CONFIG_RF_COMMON_RFLDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_RF_COMMON_RFLDO_TRIM_OUTPUT(n)      ((uint32_t)(n) << FCFG1_CONFIG_RF_COMMON_RFLDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_RF_COMMON_CTL_PA_20DBM_TRIM_SHIFT     (16)      /* Bits 16-20 */
#define FCFG1_CONFIG_RF_COMMON_CTL_PA_20DBM_TRIM_MASK      (31 << FCFG1_CONFIG_RF_COMMON_CTL_PA_20DBM_TRIM_SHIFT)
#  define FCFG1_CONFIG_RF_COMMON_CTL_PA_20DBM_TRIM(n)      ((uint32_t)(n) << FCFG1_CONFIG_RF_COMMON_CTL_PA_20DBM_TRIM_SHIFT)
#define FCFG1_CONFIG_RF_COMMON_PA20DBMTRIMCOMPLETE_N       (1 << 21)  /* Bit 21 */
#define FCFG1_CONFIG_RF_COMMON_SLDO_TRIM_OUTPUT_SHIFT      (25)      /* Bits 25-30 */
#define FCFG1_CONFIG_RF_COMMON_SLDO_TRIM_OUTPUT_MASK       (0x3f << FCFG1_CONFIG_RF_COMMON_SLDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_RF_COMMON_SLDO_TRIM_OUTPUT(n)       ((uint32_t)(n) << FCFG1_CONFIG_RF_COMMON_SLDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_RF_COMMON_DISABLE_CORNER_CAP          (1 << 31)  /* Bit 21 */

/* TIVA_FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4 */

#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N (1 << 5)  /* Bit 5 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_LDOVCO_TRIM_OUTPUT_SHIFT        (6)       /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_LDOVCO_TRIM_OUTPUT_MASK         (0x3f << FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_LDOVCO_TRIM_OUTPUT(n)         ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_RFC_MDM_DEMIQMC0_SHIFT          (12)      /* Bits 12-27 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_RFC_MDM_DEMIQMC0_MASK           (0xffff << FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_RFC_MDM_DEMIQMC0(n)           ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_MIN_ALLOWED_RTRIM_SHIFT         (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_MIN_ALLOWED_RTRIM_MASK          (15 << FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_MIN_ALLOWED_RTRIM(n)          ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV2_CC26_2G4_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4 */

#define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N (1 << 5)  /* Bit 5 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_LDOVCO_TRIM_OUTPUT_SHIFT        (6)       /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_LDOVCO_TRIM_OUTPUT_MASK         (0x3f << FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_LDOVCO_TRIM_OUTPUT(n)         ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_RFC_MDM_DEMIQMC0_SHIFT          (12)      /* Bits 12-27 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_RFC_MDM_DEMIQMC0_MASK           (0xffff << FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_RFC_MDM_DEMIQMC0(n)           ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_MIN_ALLOWED_RTRIM_SHIFT         (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_MIN_ALLOWED_RTRIM_MASK          (15 << FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_MIN_ALLOWED_RTRIM(n)          ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV2_CC13_2G4_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_SYNTH_DIV2_CC26_1G */

#define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N (1 << 5)  /* Bit 5 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_LDOVCO_TRIM_OUTPUT_SHIFT        (6)       /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_LDOVCO_TRIM_OUTPUT_MASK         (0x3f << FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_LDOVCO_TRIM_OUTPUT(n)         ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_RFC_MDM_DEMIQMC0_SHIFT          (12)      /* Bits 12-27 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_RFC_MDM_DEMIQMC0_MASK           (0xffff << FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_RFC_MDM_DEMIQMC0(n)           ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_MIN_ALLOWED_RTRIM_SHIFT         (28)      /* Bits 28-13 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_MIN_ALLOWED_RTRIM_MASK          (15 << FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_MIN_ALLOWED_RTRIM(n)          ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV2_CC26_1G_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_SYNTH_DIV2_CC13_1G */

#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N (1 << 5)  /* Bit 5 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_LDOVCO_TRIM_OUTPUT_SHIFT        (6)       /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_LDOVCO_TRIM_OUTPUT_MASK         (0x3f << FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_LDOVCO_TRIM_OUTPUT(n)         ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_RFC_MDM_DEMIQMC0_SHIFT          (12)      /* Bits 12-27 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_RFC_MDM_DEMIQMC0_MASK           (0xffff << FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_RFC_MDM_DEMIQMC0(n)           ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_MIN_ALLOWED_RTRIM_SHIFT         (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_MIN_ALLOWED_RTRIM_MASK          (15 << FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_MIN_ALLOWED_RTRIM(n)          ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV2_CC13_1G_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_SYNTH_DIV4_CC26 */

#define FCFG1_CONFIG_SYNTH_DIV4_CC26_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N (1 << 5)  /* Bit 5 */
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_LDOVCO_TRIM_OUTPUT_SHIFT        (6)       /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_LDOVCO_TRIM_OUTPUT_MASK         (0x3f << FCFG1_CONFIG_SYNTH_DIV4_CC26_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV4_CC26_LDOVCO_TRIM_OUTPUT(n)         ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV4_CC26_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_RFC_MDM_DEMIQMC0_SHIFT          (12)      /* Bits 12-27 */
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_RFC_MDM_DEMIQMC0_MASK           (0xffff << FCFG1_CONFIG_SYNTH_DIV4_CC26_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV4_CC26_RFC_MDM_DEMIQMC0(n)           ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV4_CC26_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_MIN_ALLOWED_RTRIM_SHIFT         (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_SYNTH_DIV4_CC26_MIN_ALLOWED_RTRIM_MASK          (15 << FCFG1_CONFIG_SYNTH_DIV4_CC26_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV4_CC26_MIN_ALLOWED_RTRIM(n)          ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV4_CC26_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_SYNTH_DIV4_CC13 */

#define FCFG1_CONFIG_SYNTH_DIV4_CC13_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N (1 << 5)  /* Bit 5 */
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_LDOVCO_TRIM_OUTPUT_SHIFT        (6)       /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_LDOVCO_TRIM_OUTPUT_MASK         (0x3f << FCFG1_CONFIG_SYNTH_DIV4_CC13_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV4_CC13_LDOVCO_TRIM_OUTPUT(n)         ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV4_CC13_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_RFC_MDM_DEMIQMC0_SHIFT          (12)      /* Bits 12-27 */
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_RFC_MDM_DEMIQMC0_MASK           (0xffff << FCFG1_CONFIG_SYNTH_DIV4_CC13_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV4_CC13_RFC_MDM_DEMIQMC0(n)           ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV4_CC13_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_MIN_ALLOWED_RTRIM_SHIFT         (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_SYNTH_DIV4_CC13_MIN_ALLOWED_RTRIM_MASK          (15 << FCFG1_CONFIG_SYNTH_DIV4_CC13_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV4_CC13_MIN_ALLOWED_RTRIM(n)          ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV4_CC13_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_SYNTH_DIV5 */

