apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_fcfg1.h
#define FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N      (1 << 5)  /* Bit 5 */
#define FCFG1_CONFIG_SYNTH_DIV5_LDOVCO_TRIM_OUTPUT_SHIFT             (6)       /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV5_LDOVCO_TRIM_OUTPUT_MASK              (0x3f << FCFG1_CONFIG_SYNTH_DIV5_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV5_LDOVCO_TRIM_OUTPUT(n)              ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV5_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0_SHIFT               (12)      /* Bits 12-27 */
#define FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0_MASK                (0xffff << FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0(n)                ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV5_MIN_ALLOWED_RTRIM_SHIFT              (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_SYNTH_DIV5_MIN_ALLOWED_RTRIM_MASK               (15 << FCFG1_CONFIG_SYNTH_DIV5_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV5_MIN_ALLOWED_RTRIM(n)               ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV5_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_SYNTH_DIV6_CC26 */

#define FCFG1_CONFIG_SYNTH_DIV6_CC26_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N (1 << 5)  /* Bit 5 */
#define FCFG1_CONFIG_SYNTH_DIV6_CC26_LDOVCO_TRIM_OUTPUT_SHIFT        (6)       /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV6_CC26_LDOVCO_TRIM_OUTPUT_MASK         (0x3f << FCFG1_CONFIG_SYNTH_DIV6_CC26_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV6_CC26_LDOVCO_TRIM_OUTPUT(n)         ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV6_CC26_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV6_CC26_RFC_MDM_DEMIQMC0_SHIFT          (12)      /* Bits 12-27 */
#define FCFG1_CONFIG_SYNTH_DIV6_CC26_RFC_MDM_DEMIQMC0_MASK           (0xffff << FCFG1_CONFIG_SYNTH_DIV6_CC26_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV6_CC26_RFC_MDM_DEMIQMC0(n)           ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV6_CC26_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV6_CC26_MIN_ALLOWED_RTRIM_SHIFT         (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_SYNTH_DIV6_CC26_MIN_ALLOWED_RTRIM_MASK          (15 << FCFG1_CONFIG_SYNTH_DIV6_CC26_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV6_CC26_MIN_ALLOWED_RTRIM(n)          ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV6_CC26_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_SYNTH_DIV6_CC13 */

#define FCFG1_CONFIG_SYNTH_DIV6_CC13_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N (1 << 5)  /* Bit 5 */
#define FCFG1_CONFIG_SYNTH_DIV6_CC13_LDOVCO_TRIM_OUTPUT_SHIFT        (6)       /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV6_CC13_LDOVCO_TRIM_OUTPUT_MASK         (0x3f << FCFG1_CONFIG_SYNTH_DIV6_CC13_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV6_CC13_LDOVCO_TRIM_OUTPUT(n)         ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV6_CC13_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV6_CC13_RFC_MDM_DEMIQMC0_SHIFT          (12)      /* Bits 12-27 */
#define FCFG1_CONFIG_SYNTH_DIV6_CC13_RFC_MDM_DEMIQMC0_MASK           (0xffff << FCFG1_CONFIG_SYNTH_DIV6_CC13_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV6_CC13_RFC_MDM_DEMIQMC0(n)           ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV6_CC13_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV6_CC13_MIN_ALLOWED_RTRIM_SHIFT         (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_SYNTH_DIV6_CC13_MIN_ALLOWED_RTRIM_MASK          (15 << FCFG1_CONFIG_SYNTH_DIV6_CC13_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV6_CC13_MIN_ALLOWED_RTRIM(n)          ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV6_CC13_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_SYNTH_DIV10 */

#define FCFG1_CONFIG_SYNTH_DIV10_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N     (1 << 5)  /* Bit 5 */
#define FCFG1_CONFIG_SYNTH_DIV10_LDOVCO_TRIM_OUTPUT_SHIFT            (6)       /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV10_LDOVCO_TRIM_OUTPUT_MASK             (0x3f << FCFG1_CONFIG_SYNTH_DIV10_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV10_LDOVCO_TRIM_OUTPUT(n)             ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV10_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV10_RFC_MDM_DEMIQMC0_SHIFT              (12)      /* Bits 12-27 */
#define FCFG1_CONFIG_SYNTH_DIV10_RFC_MDM_DEMIQMC0_MASK               (0xffff << FCFG1_CONFIG_SYNTH_DIV10_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV10_RFC_MDM_DEMIQMC0(n)               ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV10_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV10_MIN_ALLOWED_RTRIM_SHIFT             (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_SYNTH_DIV10_MIN_ALLOWED_RTRIM_MASK              (15 << FCFG1_CONFIG_SYNTH_DIV10_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV10_MIN_ALLOWED_RTRIM(n)              ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV10_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_SYNTH_DIV12_CC26 */

#define FCFG1_CONFIG_SYNTH_DIV12_CC26_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N   (1 << 5)  /* Bit 5 */
#define FCFG1_CONFIG_SYNTH_DIV12_CC26_LDOVCO_TRIM_OUTPUT_SHIFT          (6)       /* Bits 6-1 */
#define FCFG1_CONFIG_SYNTH_DIV12_CC26_LDOVCO_TRIM_OUTPUT_MASK           (0x3f << FCFG1_CONFIG_SYNTH_DIV12_CC26_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV12_CC26_LDOVCO_TRIM_OUTPUT(n)           ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV12_CC26_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV12_CC26_RFC_MDM_DEMIQMC0_SHIFT            (12)      /* Bits 12-27 */
#define FCFG1_CONFIG_SYNTH_DIV12_CC26_RFC_MDM_DEMIQMC0_MASK             (0xffff << FCFG1_CONFIG_SYNTH_DIV12_CC26_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV12_CC26_RFC_MDM_DEMIQMC0(n)             ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV12_CC26_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV12_CC26_MIN_ALLOWED_RTRIM_SHIFT           (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_SYNTH_DIV12_CC26_MIN_ALLOWED_RTRIM_MASK            (15 << FCFG1_CONFIG_SYNTH_DIV12_CC26_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV12_CC26_MIN_ALLOWED_RTRIM(n)            ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV12_CC26_MIN_ALLOWED_RTRIM_SHIFT)

