apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_fcfg1.h
/* TIVA_FCFG1_CONFIG_SYNTH_DIV12_CC13 */

#define FCFG1_CONFIG_SYNTH_DIV12_CC13_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N   (1 << 5)  /* Bit 5 */
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_LDOVCO_TRIM_OUTPUT_SHIFT          (6)       /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_LDOVCO_TRIM_OUTPUT_MASK           (0x3f << FCFG1_CONFIG_SYNTH_DIV12_CC13_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV12_CC13_LDOVCO_TRIM_OUTPUT(n)           ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV12_CC13_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_RFC_MDM_DEMIQMC0_SHIFT            (12)      /* Bits 12-27 */
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_RFC_MDM_DEMIQMC0_MASK             (0xffff << FCFG1_CONFIG_SYNTH_DIV12_CC13_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV12_CC13_RFC_MDM_DEMIQMC0(n)             ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV12_CC13_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_MIN_ALLOWED_RTRIM_SHIFT           (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_SYNTH_DIV12_CC13_MIN_ALLOWED_RTRIM_MASK            (15 << FCFG1_CONFIG_SYNTH_DIV12_CC13_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV12_CC13_MIN_ALLOWED_RTRIM(n)            ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV12_CC13_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_SYNTH_DIV15 */

#define FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N     (1 << 5)  /* Bit 5 */
#define FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT_SHIFT            (6)       /* Bits 6-1 */
#define FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT_MASK             (0x3f << FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT(n)             ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_SHIFT              (12)      /* Bits 12-27 */
#define FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_MASK               (0xffff << FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0(n)               ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV15_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV15_MIN_ALLOWED_RTRIM_SHIFT             (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_SYNTH_DIV15_MIN_ALLOWED_RTRIM_MASK              (15 << FCFG1_CONFIG_SYNTH_DIV15_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV15_MIN_ALLOWED_RTRIM(n)              ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV15_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_CONFIG_SYNTH_DIV30 */

#define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N     (1 << 5)  /* Bit 5 */
#define FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT_SHIFT            (6)       /* Bits 6-11 */
#define FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT_MASK             (0x3f << FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT(n)             ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_SHIFT              (12)      /* Bits 12-17 */
#define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_MASK               (0xffff << FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0(n)               ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_SHIFT)
#define FCFG1_CONFIG_SYNTH_DIV30_MIN_ALLOWED_RTRIM_SHIFT             (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_SYNTH_DIV30_MIN_ALLOWED_RTRIM_MASK              (15 << FCFG1_CONFIG_SYNTH_DIV30_MIN_ALLOWED_RTRIM_SHIFT)
#  define FCFG1_CONFIG_SYNTH_DIV30_MIN_ALLOWED_RTRIM(n)              ((uint32_t)(n) << FCFG1_CONFIG_SYNTH_DIV30_MIN_ALLOWED_RTRIM_SHIFT)

/* TIVA_FCFG1_FLASH_NUMBER (32-bit value,  Number of the manufacturing lot that produced this unit.) */

/* TIVA_FCFG1_FLASH_COORDINATE */

#define FCFG1_FLASH_COORDINATE_YCOORDINATE_SHIFT           (0)       /* Bits 0-15: Y coordinate of this unit on the wafer */
#define FCFG1_FLASH_COORDINATE_YCOORDINATE_MASK            (0xffff << FCFG1_FLASH_COORDINATE_YCOORDINATE_SHIFT)
#  define FCFG1_FLASH_COORDINATE_YCOORDINATE(n)            ((uint32_t)(n) << FCFG1_FLASH_COORDINATE_YCOORDINATE_SHIFT)
#define FCFG1_FLASH_COORDINATE_XCOORDINATE_SHIFT           (16)      /* Bits 16-31:  X coordinate of this unit on the wafer */
#define FCFG1_FLASH_COORDINATE_XCOORDINATE_MASK            (0xffff << FCFG1_FLASH_COORDINATE_XCOORDINATE_SHIFT)
#  define FCFG1_FLASH_COORDINATE_XCOORDINATE(n)            ((uint32_t)(n) << FCFG1_FLASH_COORDINATE_XCOORDINATE_SHIFT)

/* TIVA_FCFG1_FLASH_E_P */

#define FCFG1_FLASH_E_P_EVSU_SHIFT                         (0)       /* Bits 0-7 */
#define FCFG1_FLASH_E_P_EVSU_MASK                          (0xff << FCFG1_FLASH_E_P_EVSU_SHIFT)
#  define FCFG1_FLASH_E_P_EVSU(n)                          ((uint32_t)(n) << FCFG1_FLASH_E_P_EVSU_SHIFT)
#define FCFG1_FLASH_E_P_PVSU_SHIFT                         (8)       /* Bits 8-15 */
#define FCFG1_FLASH_E_P_ESU_SHIFT                          (16)      /* Bits 16-23 */
#define FCFG1_FLASH_E_P_ESU_MASK                           (0xff << FCFG1_FLASH_E_P_ESU_SHIFT)
#  define FCFG1_FLASH_E_P_ESU(n)                           ((uint32_t)(n) << FCFG1_FLASH_E_P_ESU_SHIFT)
#define FCFG1_FLASH_E_P_PVSU_MASK                          (0xff << FCFG1_FLASH_E_P_PVSU_SHIFT)
#  define FCFG1_FLASH_E_P_PVSU(n)                          ((uint32_t)(n) << FCFG1_FLASH_E_P_PVSU_SHIFT)
#define FCFG1_FLASH_E_P_PSU_SHIFT                          (24)      /* Bits 24-31 */
#define FCFG1_FLASH_E_P_PSU_MASK                           (0xff << FCFG1_FLASH_E_P_PSU_SHIFT)
#  define FCFG1_FLASH_E_P_PSU(n)                           ((uint32_t)(n) << FCFG1_FLASH_E_P_PSU_SHIFT)

/* TIVA_FCFG1_FLASH_C_E_P_R */

#define FCFG1_FLASH_C_E_P_R_CVSU_SHIFT                     (0)       /* Bits 0-11 */
#define FCFG1_FLASH_C_E_P_R_CVSU_MASK                      (0xfff << FCFG1_FLASH_C_E_P_R_CVSU_SHIFT)
#  define FCFG1_FLASH_C_E_P_R_CVSU(n)                      ((uint32_t)(n) << FCFG1_FLASH_C_E_P_R_CVSU_SHIFT)
#define FCFG1_FLASH_C_E_P_R_A_EXEZ_SETUP_SHIFT             (12)      /* Bits 12-15 */
#define FCFG1_FLASH_C_E_P_R_A_EXEZ_SETUP_MASK              (15 << FCFG1_FLASH_C_E_P_R_A_EXEZ_SETUP_SHIFT)
#  define FCFG1_FLASH_C_E_P_R_A_EXEZ_SETUP(n)              ((uint32_t)(n) << FCFG1_FLASH_C_E_P_R_A_EXEZ_SETUP_SHIFT)
#define FCFG1_FLASH_C_E_P_R_PV_ACCESS_SHIFT                (16)      /* Bits 16-23 */
#define FCFG1_FLASH_C_E_P_R_PV_ACCESS_MASK                 (0xff << FCFG1_FLASH_C_E_P_R_PV_ACCESS_SHIFT)
#  define FCFG1_FLASH_C_E_P_R_PV_ACCESS(n)                 ((uint32_t)(n) << FCFG1_FLASH_C_E_P_R_PV_ACCESS_SHIFT)
#define FCFG1_FLASH_C_E_P_R_RVSU_SHIFT                     (24)      /* Bits 24-31 */
#define FCFG1_FLASH_C_E_P_R_RVSU_MASK                      (0xff << FCFG1_FLASH_C_E_P_R_RVSU_SHIFT)
#  define FCFG1_FLASH_C_E_P_R_RVSU(n)                      ((uint32_t)(n) << FCFG1_FLASH_C_E_P_R_RVSU_SHIFT)

/* TIVA_FCFG1_FLASH_P_R_PV */

