apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_fcfg1.h
#define FCFG1_ANA2_TRIM_DCDC_HIGH_EN_SEL_SHIFT             (0)       /* Bits 0-2 */
#define FCFG1_ANA2_TRIM_DCDC_HIGH_EN_SEL_MASK              (7 << FCFG1_ANA2_TRIM_DCDC_HIGH_EN_SEL_SHIFT)
#  define FCFG1_ANA2_TRIM_DCDC_HIGH_EN_SEL(n)              ((uint32_t)(n) << FCFG1_ANA2_TRIM_DCDC_HIGH_EN_SEL_SHIFT)
#define FCFG1_ANA2_TRIM_DCDC_LOW_EN_SEL_SHIFT              (3)       /* Bits 3-5 */
#define FCFG1_ANA2_TRIM_DCDC_LOW_EN_SEL_MASK               (7 << FCFG1_ANA2_TRIM_DCDC_LOW_EN_SEL_SHIFT)
#  define FCFG1_ANA2_TRIM_DCDC_LOW_EN_SEL(n)               ((uint32_t)(n) << FCFG1_ANA2_TRIM_DCDC_LOW_EN_SEL_SHIFT)
#define FCFG1_ANA2_TRIM_DEAD_TIME_TRIM_SHIFT               (6)       /* Bits 6-7 */
#define FCFG1_ANA2_TRIM_DEAD_TIME_TRIM_MASK                (3 << FCFG1_ANA2_TRIM_DEAD_TIME_TRIM_SHIFT)
#  define FCFG1_ANA2_TRIM_DEAD_TIME_TRIM(n)                ((uint32_t)(n) << FCFG1_ANA2_TRIM_DEAD_TIME_TRIM_SHIFT)
#define FCFG1_ANA2_TRIM_DCDC_IPEAK_SHIFT                   (8)       /* Bits 8-10 */
#define FCFG1_ANA2_TRIM_DCDC_IPEAK_MASK                    (7 << FCFG1_ANA2_TRIM_DCDC_IPEAK_SHIFT)
#  define FCFG1_ANA2_TRIM_DCDC_IPEAK(n)                    ((uint32_t)(n) << FCFG1_ANA2_TRIM_DCDC_IPEAK_SHIFT)
#define FCFG1_ANA2_TRIM_DITHER_EN                          (1 << 11) /* Bit 11 */
#define FCFG1_ANA2_TRIM_NANOAMP_RES_TRIM_SHIFT             (15)      /* Bits 15-21 */
#define FCFG1_ANA2_TRIM_NANOAMP_RES_TRIM_MASK              (0x7f << FCFG1_ANA2_TRIM_NANOAMP_RES_TRIM_SHIFT)
#  define FCFG1_ANA2_TRIM_NANOAMP_RES_TRIM(n)              ((uint32_t)(n) << FCFG1_ANA2_TRIM_NANOAMP_RES_TRIM_SHIFT)
#define FCFG1_ANA2_TRIM_ATESTLF_UDIGLDO_IBIAS_TRIM         (1 << 22) /* Bit 22 */
#define FCFG1_ANA2_TRIM_SET_RCOSC_HF_FINE_RESISTOR_SHIFT   (23)      /* Bits 23-24 */
#define FCFG1_ANA2_TRIM_SET_RCOSC_HF_FINE_RESISTOR_MASK    (3 << FCFG1_ANA2_TRIM_SET_RCOSC_HF_FINE_RESISTOR_SHIFT)
#  define FCFG1_ANA2_TRIM_SET_RCOSC_HF_FINE_RESISTOR(n)    ((uint32_t)(n) << FCFG1_ANA2_TRIM_SET_RCOSC_HF_FINE_RESISTOR_SHIFT)
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_SHIFT            (26)      /* Bits 26-30 */
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_MASK             (31 << FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_SHIFT)
#  define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT(n)             ((uint32_t)(n) << FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_SHIFT)
#define FCFG1_ANA2_TRIM_RCOSCHFCTRIMFRACT_EN               (1 << 31)  /* Bit 31 */

/* TIVA_FCFG1_LDO_TRIM */

#define FCFG1_LDO_TRIM_VTRIM_DELTA_SHIFT                   (0)      /* Bits 0-2 */
#define FCFG1_LDO_TRIM_VTRIM_DELTA_MASK                    (7 << FCFG1_LDO_TRIM_VTRIM_DELTA_SHIFT)
#  define FCFG1_LDO_TRIM_VTRIM_DELTA(n)                    ((uint32_t)(n) << FCFG1_LDO_TRIM_VTRIM_DELTA_SHIFT)
#define FCFG1_LDO_TRIM_ITRIM_UDIGLDO_SHIFT                 (8)      /* Bits 8-19 */
#define FCFG1_LDO_TRIM_ITRIM_UDIGLDO_MASK                  (7 << FCFG1_LDO_TRIM_ITRIM_UDIGLDO_SHIFT)
#  define FCFG1_LDO_TRIM_ITRIM_UDIGLDO(n)                  ((uint32_t)(n) << FCFG1_LDO_TRIM_ITRIM_UDIGLDO_SHIFT)
#define FCFG1_LDO_TRIM_ITRIM_DIGLDO_LOAD_SHIFT             (11)      /* Bits 11-12 */
#define FCFG1_LDO_TRIM_ITRIM_DIGLDO_LOAD_MASK              (3 << FCFG1_LDO_TRIM_ITRIM_DIGLDO_LOAD_SHIFT)
#  define FCFG1_LDO_TRIM_ITRIM_DIGLDO_LOAD(n)              ((uint32_t)(n) << FCFG1_LDO_TRIM_ITRIM_DIGLDO_LOAD_SHIFT)
#define FCFG1_LDO_TRIM_GLDO_CURSRC_SHIFT                   (16)      /* Bits 16-18 */
#define FCFG1_LDO_TRIM_GLDO_CURSRC_MASK                    (7 << FCFG1_LDO_TRIM_GLDO_CURSRC_SHIFT)
#  define FCFG1_LDO_TRIM_GLDO_CURSRC(n)                    ((uint32_t)(n) << FCFG1_LDO_TRIM_GLDO_CURSRC_SHIFT)
#define FCFG1_LDO_TRIM_VDDR_TRIM_SLEEP_SHIFT               (24)      /* Bits 24-28 */
#define FCFG1_LDO_TRIM_VDDR_TRIM_SLEEP_MASK                (31 << FCFG1_LDO_TRIM_VDDR_TRIM_SLEEP_SHIFT)
#  define FCFG1_LDO_TRIM_VDDR_TRIM_SLEEP(n)                ((uint32_t)(n) << FCFG1_LDO_TRIM_VDDR_TRIM_SLEEP_SHIFT)

/* TIVA_FCFG1_MAC_BLE_0 (32-bit value, The first 32-bits of the 64-bit MAC BLE address) */
/* TIVA_FCFG1_MAC_BLE_1 (32-bit value,  The last 32-bits of the 64-bit MAC BLE address) */
/* TIVA_FCFG1_MAC_15_4_0 (32-bit value, The first 32-bits of the 64-bit MAC 15.4 address) */
/* TIVA_FCFG1_MAC_15_4_1 (32-bit value, The last 32-bits of the 64-bit MAC 15.4 address) */

/* TIVA_FCFG1_FLASH_OTP_DATA4 */

#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_EXT_RD_SHIFT        (0)       /* Bits 0-2 */
#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_EXT_RD_MASK         (7 << FCFG1_FLASH_OTP_DATA4_VIN_AT_X_EXT_RD_SHIFT)
#  define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_EXT_RD(n)         ((uint32_t)(n) << FCFG1_FLASH_OTP_DATA4_VIN_AT_X_EXT_RD_SHIFT)
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_EXT_RD              (1 << 3)  /* Bit 3 */
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_EXT_RD           (1 << 4)  /* Bit 4 */
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_RD_SHIFT  (5)       /* Bits 5-6 */
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_RD_MASK   (3 << FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_RD_SHIFT)
#  define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_RD(n)   ((uint32_t)(n) << FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_RD_SHIFT)
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_EXT_RD      (1 << 7)  /* Bit 7 */
#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_INT_RD_SHIFT        (8)       /* Bits 8-10 */
#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_INT_RD_MASK         (7 << FCFG1_FLASH_OTP_DATA4_VIN_AT_X_INT_RD_SHIFT)
#  define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_INT_RD(n)         ((uint32_t)(n) << FCFG1_FLASH_OTP_DATA4_VIN_AT_X_INT_RD_SHIFT)
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_INT_RD              (1 << 11) /* Bit 11 */
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_INT_RD           (1 << 12) /* Bit 12 */
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_RD_SHIFT  (13)      /* Bits 13-14 */
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_RD_MASK   (3 << FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_RD_SHIFT)
#  define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_RD(n)   ((uint32_t)(n) << FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_RD_SHIFT)
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_RD      (1 << 15) /* Bit 15 */
#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_EXT_WRT_SHIFT       (16)      /* Bits nn-nn */
#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_EXT_WRT_MASK        (7 << FCFG1_FLASH_OTP_DATA4_VIN_AT_X_EXT_WRT_SHIFT)
#  define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_EXT_WRT(n)        ((uint32_t)(n) << FCFG1_FLASH_OTP_DATA4_VIN_AT_X_EXT_WRT_SHIFT)
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_EXT_WRT             (1 << 19) /* Bit 19 */
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_EXT_WRT          (1 << 20) /* Bit 20 */
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_WRT_SHIFT (21)      /* Bits 21-22 */
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_WRT_MASK  (3 << FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_WRT_SHIFT)
#  define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_WRT(n)  ((uint32_t)(n) << FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_WRT_SHIFT)
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_EXT_WRT     (1 << 23) /* Bit 23 */
#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_INT_WRT_SHIFT       (24)      /* Bits 24-26 */
#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_INT_WRT_MASK        (7 << FCFG1_FLASH_OTP_DATA4_VIN_AT_X_INT_WRT_SHIFT)
#  define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_INT_WRT(n)        ((uint32_t)(n) << FCFG1_FLASH_OTP_DATA4_VIN_AT_X_INT_WRT_SHIFT)
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_INT_WRT             (1 << 27) /* Bit 27 */
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_INT_WRT          (1 << 28) /* Bit 28 */
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_WRT_SHIFT (29)      /* Bits 29-30 */
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_WRT_MASK  (3 << FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_WRT_SHIFT)
#  define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_WRT(n)  ((uint32_t)(n) << FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_WRT_SHIFT)
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_WRT     (1 << 31) /* Bit 31 */

/* TIVA_FCFG1_MISC_TRIM */

