apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_fcfg1.h
#define FCFG1_MISC_TRIM_TEMPVSLOPE_SHIFT                   (0)       /* Bits 0-7: TEMP slope with battery voltage, in
degrees C */
#define FCFG1_MISC_TRIM_TEMPVSLOPE_MASK                    (0xff << FCFG1_MISC_TRIM_TEMPVSLOPE_SHIFT)
#  define FCFG1_MISC_TRIM_TEMPVSLOPE(n)                    ((uint32_t)(n) << FCFG1_MISC_TRIM_TEMPVSLOPE_SHIFT)
#define FCFG1_MISC_TRIM_TRIM_RECHARGE_COMP_REFLEVEL_SHIFT  (8)       /* Bits 8-11 */
#define FCFG1_MISC_TRIM_TRIM_RECHARGE_COMP_REFLEVEL_MASK   (15 << FCFG1_MISC_TRIM_TRIM_RECHARGE_COMP_REFLEVEL_SHIFT)
#  define FCFG1_MISC_TRIM_TRIM_RECHARGE_COMP_REFLEVEL(n)   ((uint32_t)(n) << FCFG1_MISC_TRIM_TRIM_RECHARGE_COMP_REFLEVEL_SHIFT)
#define FCFG1_MISC_TRIM_TRIM_RECHARGE_COMP_OFFSET_SHIFT    (12)      /* Bits 12-16 */
#define FCFG1_MISC_TRIM_TRIM_RECHARGE_COMP_OFFSET_MASK     (31 << FCFG1_MISC_TRIM_TRIM_RECHARGE_COMP_OFFSET_SHIFT)
#  define FCFG1_MISC_TRIM_TRIM_RECHARGE_COMP_OFFSET(n)     ((uint32_t)(n) << FCFG1_MISC_TRIM_TRIM_RECHARGE_COMP_OFFSET_SHIFT)

/* TIVA_FCFG1_RCOSC_HF_TEMPCOMP */

#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_SLOPE_SHIFT     (0)       /* Bits 0-7 */
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_SLOPE_MASK      (0xff << FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_SLOPE_SHIFT)
#  define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_SLOPE(n)      ((uint32_t)(n) << FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_SLOPE_SHIFT)
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_QUAD_SHIFT      (8)       /* Bits 8-15 */
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_QUAD_MASK       (0xff << FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_QUAD_SHIFT)
#  define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_QUAD(n)       ((uint32_t)(n) << FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_QUAD_SHIFT)
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIM_SHIFT                (16)      /* Bits 16-24 */
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIM_MASK                 (0xff << FCFG1_RCOSC_HF_TEMPCOMP_CTRIM_SHIFT)
#  define FCFG1_RCOSC_HF_TEMPCOMP_CTRIM(n)                 ((uint32_t)(n) << FCFG1_RCOSC_HF_TEMPCOMP_CTRIM_SHIFT)
#define FCFG1_RCOSC_HF_TEMPCOMP_FINE_RESISTOR_SHIFT        (24)      /* Bits 24-31 */
#define FCFG1_RCOSC_HF_TEMPCOMP_FINE_RESISTOR_MASK         (0xff << FCFG1_RCOSC_HF_TEMPCOMP_FINE_RESISTOR_SHIFT)
#  define FCFG1_RCOSC_HF_TEMPCOMP_FINE_RESISTOR(n)         ((uint32_t)(n) << FCFG1_RCOSC_HF_TEMPCOMP_FINE_RESISTOR_SHIFT)

/* TIVA_FCFG1_ICEPICK_DEVICE_ID */

#define FCFG1_ICEPICK_DEVICE_ID_MANUFACTURER_ID_SHIFT      (0)       /* Bits 0-11:  0x02F: Texas Instruments */
#define FCFG1_ICEPICK_DEVICE_ID_MANUFACTURER_ID_MASK       (0xfff << FCFG1_ICEPICK_DEVICE_ID_MANUFACTURER_ID_SHIFT)
#  define FCFG1_ICEPICK_DEVICE_ID_MANUFACTURER_ID(n)       ((uint32_t)(n) << FCFG1_ICEPICK_DEVICE_ID_MANUFACTURER_ID_SHIFT)
#define FCFG1_ICEPICK_DEVICE_ID_WAFER_ID_SHIFT             (12)      /* Bits 12-27: Identifies silicon die */
#define FCFG1_ICEPICK_DEVICE_ID_WAFER_ID_MASK              (0xffff << FCFG1_ICEPICK_DEVICE_ID_WAFER_ID_SHIFT)
#  define FCFG1_ICEPICK_DEVICE_ID_WAFER_ID(n)              ((uint32_t)(n) << FCFG1_ICEPICK_DEVICE_ID_WAFER_ID_SHIFT)
#define FCFG1_ICEPICK_DEVICE_ID_PG_REV_SHIFT               (28)      /* Bits 28-31:  Revision of the device */
#define FCFG1_ICEPICK_DEVICE_ID_PG_REV_MASK                (15 << FCFG1_ICEPICK_DEVICE_ID_PG_REV_SHIFT)
#  define FCFG1_ICEPICK_DEVICE_ID_PG_REV(n)                ((uint32_t)(n) << FCFG1_ICEPICK_DEVICE_ID_PG_REV_SHIFT)

/* TIVA_FCFG1_FCFG1_REVISION (32-bit value,  The revision number of the FCFG1 layout) */

/* TIVA_FCFG1_MISC_OTP_DATA */

#define FCFG1_MISC_OTP_DATA_TEST_PROGRAM_REV_SHIFT         (0)       /* Bits 0-7: The revision of the test program used in the production process */
#define FCFG1_MISC_OTP_DATA_TEST_PROGRAM_REV_MASK          (0xff << FCFG1_MISC_OTP_DATA_TEST_PROGRAM_REV_SHIFT)
#  define FCFG1_MISC_OTP_DATA_TEST_PROGRAM_REV(n)          ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_TEST_PROGRAM_REV_SHIFT)
#define FCFG1_MISC_OTP_DATA_PER_E_SHIFT                    (12)      /* Bits 12-14 */
#define FCFG1_MISC_OTP_DATA_PER_E_MASK                     (7 << FCFG1_MISC_OTP_DATA_PER_E_SHIFT)
#  define FCFG1_MISC_OTP_DATA_PER_E(n)                     ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_PER_E_SHIFT)
#define FCFG1_MISC_OTP_DATA_PER_M_SHIFT                    (15)      /* Bits 15-19 */
#define FCFG1_MISC_OTP_DATA_PER_M_MASK                     (31 << FCFG1_MISC_OTP_DATA_PER_M_SHIFT)
#  define FCFG1_MISC_OTP_DATA_PER_M(n)                     ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_PER_M_SHIFT)
#define FCFG1_MISC_OTP_DATA_RCOSC_HF_CRIM_SHIFT            (20)      /* Bits 20-17 */
#define FCFG1_MISC_OTP_DATA_RCOSC_HF_CRIM_MASK             (0xff << FCFG1_MISC_OTP_DATA_RCOSC_HF_CRIM_SHIFT)
#  define FCFG1_MISC_OTP_DATA_RCOSC_HF_CRIM(n)             ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_RCOSC_HF_CRIM_SHIFT)
#define FCFG1_MISC_OTP_DATA_RCOSC_HF_ITUNE_SHIFT           (28)      /* Bits 28-31 */
#define FCFG1_MISC_OTP_DATA_RCOSC_HF_ITUNE_MASK            (15 << FCFG1_MISC_OTP_DATA_RCOSC_HF_ITUNE_SHIFT)
#  define FCFG1_MISC_OTP_DATA_RCOSC_HF_ITUNE(n)            ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_RCOSC_HF_ITUNE_SHIFT)

/* TIVA_FCFG1_IOCONF */

#define FCFG1_IOCONF_GPIO_CNT_SHIFT                        (0)       /* Bits 0-6: Number of available DIOs */
#define FCFG1_IOCONF_GPIO_CNT_MASK                         (0x75 << FCFG1_IOCONF_GPIO_CNT_SHIFT)
#  define FCFG1_IOCONF_GPIO_CNT(n)                         ((uint32_t)(n) << FCFG1_IOCONF_GPIO_CNT_SHIFT)

/* TIVA_FCFG1_CONFIG_IF_ADC */

#define FCFG1_CONFIG_IF_ADC_IFANALDO_TRIM_OUTPUT_SHIFT     (0)       /* Bits 0-4 */
#define FCFG1_CONFIG_IF_ADC_IFANALDO_TRIM_OUTPUT_MASK      (0x1f << FCFG1_CONFIG_IF_ADC_IFANALDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_IF_ADC_IFANALDO_TRIM_OUTPUT(n)      ((uint32_t)(n) << FCFG1_CONFIG_IF_ADC_IFANALDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_IF_ADC_IFDIGLDO_TRIM_OUTPUT_SHIFT     (5)       /* Bits 5-9 */
#define FCFG1_CONFIG_IF_ADC_IFDIGLDO_TRIM_OUTPUT_MASK      (31 << FCFG1_CONFIG_IF_ADC_IFDIGLDO_TRIM_OUTPUT_SHIFT)
#  define FCFG1_CONFIG_IF_ADC_IFDIGLDO_TRIM_OUTPUT(n)      ((uint32_t)(n) << FCFG1_CONFIG_IF_ADC_IFDIGLDO_TRIM_OUTPUT_SHIFT)
#define FCFG1_CONFIG_IF_ADC_INT2ADJ_SHIFT                  (10)      /* Bits 10-13 */
#define FCFG1_CONFIG_IF_ADC_INT2ADJ_MASK                   (15 << FCFG1_CONFIG_IF_ADC_INT2ADJ_SHIFT)
#  define FCFG1_CONFIG_IF_ADC_INT2ADJ(n)                   ((uint32_t)(n) << FCFG1_CONFIG_IF_ADC_INT2ADJ_SHIFT)
#define FCFG1_CONFIG_IF_ADC_AAFCAP_SHIFT                   (14)      /* Bits 14-15 */
#define FCFG1_CONFIG_IF_ADC_AAFCAP_MASK                    (3 << FCFG1_CONFIG_IF_ADC_AAFCAP_SHIFT)
#  define FCFG1_CONFIG_IF_ADC_AAFCAP(n)                    ((uint32_t)(n) << FCFG1_CONFIG_IF_ADC_AAFCAP_SHIFT)
#define FCFG1_CONFIG_IF_ADC_FF1ADJ_SHIFT                   (16)      /* Bits 16-19 */
#define FCFG1_CONFIG_IF_ADC_FF1ADJ_MASK                    (15 << FCFG1_CONFIG_IF_ADC_FF1ADJ_SHIFT)
#  define FCFG1_CONFIG_IF_ADC_FF1ADJ(n)                    ((uint32_t)(n) << FCFG1_CONFIG_IF_ADC_FF1ADJ_SHIFT)
#define FCFG1_CONFIG_IF_ADC_INT3ADJ_SHIFT                  (20)      /* Bits 20-23 */
#define FCFG1_CONFIG_IF_ADC_INT3ADJ_MASK                   (15 << FCFG1_CONFIG_IF_ADC_INT3ADJ_SHIFT)
#  define FCFG1_CONFIG_IF_ADC_INT3ADJ(n)                   ((uint32_t)(n) << FCFG1_CONFIG_IF_ADC_INT3ADJ_SHIFT)
#define FCFG1_CONFIG_IF_ADC_FF3ADJ_SHIFT                   (24)      /* Bits 24-27 */
#define FCFG1_CONFIG_IF_ADC_FF3ADJ_MASK                    (15 << FCFG1_CONFIG_IF_ADC_FF3ADJ_SHIFT)
#  define FCFG1_CONFIG_IF_ADC_FF3ADJ(n)                    ((uint32_t)(n) << FCFG1_CONFIG_IF_ADC_FF3ADJ_SHIFT)
#define FCFG1_CONFIG_IF_ADC_FF2ADJ_SHIFT                   (28)      /* Bits 28-31 */
#define FCFG1_CONFIG_IF_ADC_FF2ADJ_MASK                    (15 << FCFG1_CONFIG_IF_ADC_FF2ADJ_SHIFT)
#  define FCFG1_CONFIG_IF_ADC_FF2ADJ(n)                    ((uint32_t)(n) << FCFG1_CONFIG_IF_ADC_FF2ADJ_SHIFT)

/* TIVA_FCFG1_CONFIG_OSC_TOP */

