apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_fcfg1.h
#define FCFG1_CONFIG_OSC_TOP_RCOSCLF_RTUNE_TRIM_SHIFT      (0)       /* Bits 0-1 */
#define FCFG1_CONFIG_OSC_TOP_RCOSCLF_RTUNE_TRIM_MASK       (3 << FCFG1_CONFIG_OSC_TOP_RCOSCLF_RTUNE_TRIM_SHIFT)
#  define FCFG1_CONFIG_OSC_TOP_RCOSCLF_RTUNE_TRIM(n)       ((uint32_t)(n) << FCFG1_CONFIG_OSC_TOP_RCOSCLF_RTUNE_TRIM_SHIFT)
#define FCFG1_CONFIG_OSC_TOP_RCOSCLF_CTUNE_TRIM_SHIFT      (2)       /* Bits 2-9 */
#define FCFG1_CONFIG_OSC_TOP_RCOSCLF_CTUNE_TRIM_MASK       (0xff << FCFG1_CONFIG_OSC_TOP_RCOSCLF_CTUNE_TRIM_SHIFT)
#  define FCFG1_CONFIG_OSC_TOP_RCOSCLF_CTUNE_TRIM(n)       ((uint32_t)(n) << FCFG1_CONFIG_OSC_TOP_RCOSCLF_CTUNE_TRIM_SHIFT)
#define FCFG1_CONFIG_OSC_TOP_XOSC_HF_COLUMN_Q12_SHIFT      (10)      /* Bits 10-25 */
#define FCFG1_CONFIG_OSC_TOP_XOSC_HF_COLUMN_Q12_MASK       (0xffff << FCFG1_CONFIG_OSC_TOP_XOSC_HF_COLUMN_Q12_SHIFT)
#  define FCFG1_CONFIG_OSC_TOP_XOSC_HF_COLUMN_Q12(n)       ((uint32_t)(n) << FCFG1_CONFIG_OSC_TOP_XOSC_HF_COLUMN_Q12_SHIFT)
#define FCFG1_CONFIG_OSC_TOP_XOSC_HF_ROW_Q12_SHIFT         (26)      /* Bits 26-29 */
#define FCFG1_CONFIG_OSC_TOP_XOSC_HF_ROW_Q12_MASK          (15 << FCFG1_CONFIG_OSC_TOP_XOSC_HF_ROW_Q12_SHIFT)
#  define FCFG1_CONFIG_OSC_TOP_XOSC_HF_ROW_Q12(n)          ((uint32_t)(n) << FCFG1_CONFIG_OSC_TOP_XOSC_HF_ROW_Q12_SHIFT)

/* TIVA_FCFG1_SOC_ADC_ABS_GAIN */

#define FCFG1_SOC_ADC_ABS_GAIN_SOC_ADC_ABS_GAIN_TEMP1_SHIFT  (0)       /* Bits 0-15: SOC_ADC gain in absolute reference mode at temperature 1 (30C) */
#define FCFG1_SOC_ADC_ABS_GAIN_SOC_ADC_ABS_GAIN_TEMP1_MASK   (0xffff << FCFG1_SOC_ADC_ABS_GAIN_SOC_ADC_ABS_GAIN_TEMP1_SHIFT)
#  define FCFG1_SOC_ADC_ABS_GAIN_SOC_ADC_ABS_GAIN_TEMP1(n)   ((uint32_t)(n) << FCFG1_SOC_ADC_ABS_GAIN_SOC_ADC_ABS_GAIN_TEMP1_SHIFT)

/* TIVA_FCFG1_SOC_ADC_REL_GAIN */

#define FCFG1_SOC_ADC_REL_GAIN_SOC_ADC_REL_GAIN_TEMP1_SHIFT  (0)       /* Bits 0-15: SOC_ADC gain in relative reference mode at temperature 1 (30C) */
#define FCFG1_SOC_ADC_REL_GAIN_SOC_ADC_REL_GAIN_TEMP1_MASK   (0xffff << FCFG1_SOC_ADC_REL_GAIN_SOC_ADC_REL_GAIN_TEMP1_SHIFT)
#  define FCFG1_SOC_ADC_REL_GAIN_SOC_ADC_REL_GAIN_TEMP1(n)   ((uint32_t)(n) << FCFG1_SOC_ADC_REL_GAIN_SOC_ADC_REL_GAIN_TEMP1_SHIFT)

/* TIVA_FCFG1_SOC_ADC_OFFSET_INT */

#define FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_ABS_OFFSET_TEMP1_SHIFT  (0)      /* Bits 0-7: SOC_ADC offset in absolute reference mode at temperature 1 (30C) */
#define FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_ABS_OFFSET_TEMP1_MASK   (0xff << FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_ABS_OFFSET_TEMP1_SHIFT)
#  define FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_ABS_OFFSET_TEMP1(n)   ((uint32_t)(n) << FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_ABS_OFFSET_TEMP1_SHIFT)
#define FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_REL_OFFSET_TEMP1_SHIFT  (16)      /* Bits 16-23: SOC_ADC offset in relative reference mode at temperature 1 (30C) */
#define FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_REL_OFFSET_TEMP1_MASK   (0xff << FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_REL_OFFSET_TEMP1_SHIFT)
#  define FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_REL_OFFSET_TEMP1(n)   ((uint32_t)(n) << FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_REL_OFFSET_TEMP1_SHIFT)

/* TIVA_FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT */

#define FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_REF_VOLTAGE_TRIM_TEMP1_SHIFT (0)       /* Bits 0-5 */
#define FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_REF_VOLTAGE_TRIM_TEMP1_MASK  \
  (0x3f << FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_REF_VOLTAGE_TRIM_TEMP1_SHIFT)
#  define FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_REF_VOLTAGE_TRIM_TEMP1(n) \
  ((uint32_t)(n) << FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_REF_VOLTAGE_TRIM_TEMP1_SHIFT)

/* TIVA_FCFG1_AMPCOMP_TH1 */

#define FCFG1_AMPCOMP_TH1_HPMRAMP1_TH_SHIFT                (0)       /* Bits 0-5 */
#define FCFG1_AMPCOMP_TH1_HPMRAMP1_TH_MASK                 (0x3f << FCFG1_AMPCOMP_TH1_HPMRAMP1_TH_SHIFT)
#  define FCFG1_AMPCOMP_TH1_HPMRAMP1_TH(n)                 ((uint32_t)(n) << FCFG1_AMPCOMP_TH1_HPMRAMP1_TH_SHIFT)
#define FCFG1_AMPCOMP_TH1_IBIASCAP_LPTOHP_OL_CNT_SHIFT     (6)       /* Bits 6-9:*/
#define FCFG1_AMPCOMP_TH1_IBIASCAP_LPTOHP_OL_CNT_MASK      (15 << FCFG1_AMPCOMP_TH1_IBIASCAP_LPTOHP_OL_CNT_SHIFT)
#  define FCFG1_AMPCOMP_TH1_IBIASCAP_LPTOHP_OL_CNT(n)      ((uint32_t)(n) << FCFG1_AMPCOMP_TH1_IBIASCAP_LPTOHP_OL_CNT_SHIFT)
#define FCFG1_AMPCOMP_TH1_HPMRAMP3_HTH_SHIFT               (10)      /* Bits 10-15 */
#define FCFG1_AMPCOMP_TH1_HPMRAMP3_HTH_MASK                (0x3f << FCFG1_AMPCOMP_TH1_HPMRAMP3_HTH_SHIFT)
#  define FCFG1_AMPCOMP_TH1_HPMRAMP3_HTH(n)                ((uint32_t)(n) << FCFG1_AMPCOMP_TH1_HPMRAMP3_HTH_SHIFT)
#define FCFG1_AMPCOMP_TH1_HPMRAMP3_LTH_SHIFT               (18)      /* Bits 18-23 */
#define FCFG1_AMPCOMP_TH1_HPMRAMP3_LTH_MASK                (0x3f << FCFG1_AMPCOMP_TH1_HPMRAMP3_LTH_SHIFT)
#  define FCFG1_AMPCOMP_TH1_HPMRAMP3_LTH(n)                ((uint32_t)(n) << FCFG1_AMPCOMP_TH1_HPMRAMP3_LTH_SHIFT)

/* TIVA_FCFG1_AMPCOMP_TH2 */

#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_SHIFT         (2)       /* Bits 2-7 */
#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_MASK          (0x3f << FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_SHIFT)
#  define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM(n)          ((uint32_t)(n) << FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_SHIFT)
#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_SHIFT         (10)      /* Bits 10-15 */
#define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_MASK          (0x3f << FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_SHIFT)
#  define FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM(n)          ((uint32_t)(n) << FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_SHIFT)
#define FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM_SHIFT              (18)      /* Bits 18-23 */
#define FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM_MASK               (0x3f << FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM_SHIFT)
#  define FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM(n)               ((uint32_t)(n) << FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM_SHIFT)
#define FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH_SHIFT              (26)      /* Bits 26-31 */
#define FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH_MASK               (0x3f << FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH_SHIFT)
#  define FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH(n)               ((uint32_t)(n) << FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH_SHIFT)

