apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_fcfg1.h
/* TIVA_FCFG1_AMPCOMP_CTRL1 */

#define FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_SHIFT   (0)       /* Bits 0-3 */
#define FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_MASK    (15 << FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_SHIFT)
#  define FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT(n)    ((uint32_t)(n) << FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_SHIFT)
#define FCFG1_AMPCOMP_CTRL1_CAP_STEP_SHIFT                 (4)       /* Bits 4-7 */
#define FCFG1_AMPCOMP_CTRL1_CAP_STEP_MASK                  (15 << FCFG1_AMPCOMP_CTRL1_CAP_STEP_SHIFT)
#  define FCFG1_AMPCOMP_CTRL1_CAP_STEP(n)                  ((uint32_t)(n) << FCFG1_AMPCOMP_CTRL1_CAP_STEP_SHIFT)
#define FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_SHIFT (8)       /* Bits 8-15 */
#define FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_MASK  (0xff << FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_SHIFT)
#  define FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL(n)  ((uint32_t)(n) << FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_SHIFT)
#define FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_SHIFT               (16)      /* Bits 16-19 */
#define FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_MASK                (15 << FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_SHIFT)
#  define FCFG1_AMPCOMP_CTRL1_IBIAS_INIT(n)                ((uint32_t)(n) << FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_SHIFT)
#define FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_SHIFT             (20)      /* Bits 20-23 */
#define FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_MASK              (15 << FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_SHIFT)
#  define FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET(n)              ((uint32_t)(n) << FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_SHIFT)
#define FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE               (1 << 30) /* Bit 30 */

/* TIVA_FCFG1_ANABYPASS_VALUE2 */

#define FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_SHIFT    (0)       /* Bits 0-13 */
#define FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_MASK     (0x3fff << FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_SHIFT)
#  define FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM(n)     ((uint32_t)(n) << FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_SHIFT)

/* TIVA_FCFG1_VOLT_TRIM */

#define FCFG1_VOLT_TRIM_TRIMBOD_H_SHIFT                    (0)       /* Bits 0-4 */
#define FCFG1_VOLT_TRIM_TRIMBOD_H_MASK                     (31 << FCFG1_VOLT_TRIM_TRIMBOD_H_SHIFT)
#  define FCFG1_VOLT_TRIM_TRIMBOD_H(n)                     ((uint32_t)(n) << FCFG1_VOLT_TRIM_TRIMBOD_H_SHIFT)
#define FCFG1_VOLT_TRIM_VDDR_TRIM_SLEEP_H_SHIFT            (8)       /* Bits 8-12 */
#define FCFG1_VOLT_TRIM_VDDR_TRIM_SLEEP_H_MASK             (31 << FCFG1_VOLT_TRIM_VDDR_TRIM_SLEEP_H_SHIFT)
#  define FCFG1_VOLT_TRIM_VDDR_TRIM_SLEEP_H(n)             ((uint32_t)(n) << FCFG1_VOLT_TRIM_VDDR_TRIM_SLEEP_H_SHIFT)
#define FCFG1_VOLT_TRIM_VDDR_TRIM_H_SHIFT                  (16)      /* Bits 16-20 */
#define FCFG1_VOLT_TRIM_VDDR_TRIM_H_MASK                   (31 << FCFG1_VOLT_TRIM_VDDR_TRIM_H_SHIFT)
#  define FCFG1_VOLT_TRIM_VDDR_TRIM_H(n)                   ((uint32_t)(n) << FCFG1_VOLT_TRIM_VDDR_TRIM_H_SHIFT)
#define FCFG1_VOLT_TRIM_VDDR_TRIM_HH_SHIFT                 (24)      /* Bits 24-28 */
#define FCFG1_VOLT_TRIM_VDDR_TRIM_HH_MASK                  (31 << FCFG1_VOLT_TRIM_VDDR_TRIM_HH_SHIFT)
#  define FCFG1_VOLT_TRIM_VDDR_TRIM_HH(n)                  ((uint32_t)(n) << FCFG1_VOLT_TRIM_VDDR_TRIM_HH_SHIFT)

/* TIVA_FCFG1_OSC_CONF */

#define FCFG1_OSC_CONF_HPOSC_DIV3_BYPASS                   (1 << 0)  /* Bit 0 */
#define FCFG1_OSC_CONF_HPOSC_SERIES_CAP_SHIFT              (1)       /* Bits 1-2 */
#define FCFG1_OSC_CONF_HPOSC_SERIES_CAP_MASK               (3 << FCFG1_OSC_CONF_HPOSC_SERIES_CAP_SHIFT)
#  define FCFG1_OSC_CONF_HPOSC_SERIES_CAP(n)               ((uint32_t)(n) << FCFG1_OSC_CONF_HPOSC_SERIES_CAP_SHIFT)
#define FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY_SHIFT     (5)       /* Bits 5-6 */
#define FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY_MASK      (3 << FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY_SHIFT)
#  define FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY(n)      ((uint32_t)(n) << FCFG1_OSC_CONF_HPOSC_BIAS_RECHARGE_DELAY_SHIFT)
#define FCFG1_OSC_CONF_HPOSC_FILTER_EN                     (1 << 7)  /* Bit 7 */
#define FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET_SHIFT            (8)       /* Bits 8-11 */
#define FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET_MASK             (15 << FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET_SHIFT)
#  define FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET(n)             ((uint32_t)(n) << FCFG1_OSC_CONF_HPOSC_BIAS_RES_SET_SHIFT)
#define FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO_SHIFT          (12)      /* Bits 12-15 */
#define FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO_MASK           (15 << FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO_SHIFT)
#  define FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO(n)           ((uint32_t)(n) << FCFG1_OSC_CONF_HPOSC_CURRMIRR_RATIO_SHIFT)
#define FCFG1_OSC_CONF_HPOSC_BIAS_HOLD_MODE_EN             (1 << 16) /* Bit 15 */
#define FCFG1_OSC_CONF_HPOSC_OPTION                        (1 << 17) /* Bit 17  */
#define FCFG1_OSC_CONF_XOSC_OPTION                         (1 << 18) /* Bit 18: XOSC_HF available */
#define FCFG1_OSC_CONF_XOSC_HF_FAST_START_SHIFT            (19)      /* Bits 19-20: Trim value for DDI_0_OSC:CTL1.XOSC_HF_FAST_START */
#define FCFG1_OSC_CONF_XOSC_HF_FAST_START_MASK             (3 << FCFG1_OSC_CONF_XOSC_HF_FAST_START_SHIFT)
#  define FCFG1_OSC_CONF_XOSC_HF_FAST_START(n)             ((uint32_t)(n) << FCFG1_OSC_CONF_XOSC_HF_FAST_START_SHIFT)
#define FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO_SHIFT          (21)      /* Bits 21-24: rim value for DDI_0_OSC:LFOSCCTL.XOSCLF_CMIRRWR_RATIO */
#define FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO_MASK           (15 << FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO_SHIFT)
#  define FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO(n)           ((uint32_t)(n) << FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO_SHIFT)
#define FCFG1_OSC_CONF_XOSCLF_REGULATOR_TRIM_SHIFT         (25)      /* Bits 25-36: Trim value for DDI_0_OSC:LFOSCCTL.XOSCLF_REGULATOR_TRIM */
#define FCFG1_OSC_CONF_XOSCLF_REGULATOR_TRIM_MASK          (3 << FCFG1_OSC_CONF_XOSCLF_REGULATOR_TRIM_SHIFT)
#  define FCFG1_OSC_CONF_XOSCLF_REGULATOR_TRIM(n)          ((uint32_t)(n) << FCFG1_OSC_CONF_XOSCLF_REGULATOR_TRIM_SHIFT)
#define FCFG1_OSC_CONF_ATESTLF_RCOSCLF_IBIAS_TRIM          (1 << 27) /* Bit 27: Trim value for DDI_0_OSC:ATESTCTL.ATESTLF_RCOSCLF_IBIAS_TRIM */
#define FCFG1_OSC_CONF_ADC_SH_MODE_EN                      (1 << 28) /* Bit 28: Trim value for DDI_0_OSC:ADCDOUBLERNANOAMPCTL.ADC_SH_MODE_EN */
#define FCFG1_OSC_CONF_ADC_SH_VBUF_EN                      (1 << 29) /* Bit 28: Trim value for DDI_0_OSC:ADCDOUBLERNANOAMPCTL.ADC_SH_VBUF_EN */

/* TIVA_FCFG1_FREQ_OFFSET */

#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P2_SHIFT              (0)       /* Bits 0-7 */
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P2_MASK               (0xff << FCFG1_FREQ_OFFSET_HPOSC_COMP_P2_SHIFT)
#  define FCFG1_FREQ_OFFSET_HPOSC_COMP_P2(n)               ((uint32_t)(n) << FCFG1_FREQ_OFFSET_HPOSC_COMP_P2_SHIFT)
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P1_SHIFT              (8)      /* Bits 8-15 */
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P1_MASK               (0xff << FCFG1_FREQ_OFFSET_HPOSC_COMP_P1_SHIFT)
#  define FCFG1_FREQ_OFFSET_HPOSC_COMP_P1(n)               ((uint32_t)(n) << FCFG1_FREQ_OFFSET_HPOSC_COMP_P1_SHIFT)
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P0_SHIFT              (16)      /* Bits 16-31 */
#define FCFG1_FREQ_OFFSET_HPOSC_COMP_P0_MASK               (0xffff << FCFG1_FREQ_OFFSET_HPOSC_COMP_P0_SHIFT)
#  define FCFG1_FREQ_OFFSET_HPOSC_COMP_P0(n)               ((uint32_t)(n) << FCFG1_FREQ_OFFSET_HPOSC_COMP_P0_SHIFT)

/* TIVA_FCFG1_MISC_OTP_DATA_1 */

#define FCFG1_MISC_OTP_DATA_1_IDAC_STEP_SHIFT                      (0)       /* Bits 0-3 */
#define FCFG1_MISC_OTP_DATA_1_IDAC_STEP_MASK                       (15 << FCFG1_MISC_OTP_DATA_1_IDAC_STEP_SHIFT)
#  define FCFG1_MISC_OTP_DATA_1_IDAC_STEP(n)                       ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_1_IDAC_STEP_SHIFT)
#define FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_SHIFT             (4)       /* Bits 4-9 */
#define FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_MASK              (0x3f << FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_SHIFT)
#  define FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT(n)              ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_SHIFT)
#define FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_SHIFT             (10)      /* Bits 10-19 */
#define FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_MASK              (0x3ff << FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_SHIFT)
#  define FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT(n)              ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_SHIFT)
#define FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_SHIFT (20)      /* Bits 20-21 */
#define FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_MASK  (3 << FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_SHIFT)
#  define FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE(n)  ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_SHIFT)
#define FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_SHIFT                   (22)      /* Bits 22-23 */
#define FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_MASK                    (3 << FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_SHIFT)
#  define FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM(n)                    ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_SHIFT)
#define FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_SHIFT                   (24)      /* Bits 24-26 */
#define FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_MASK                    (7 << FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_SHIFT)
#  define FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM(n)                    ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_SHIFT)
#define FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_SHIFT                 (27)      /* Bits 27-28 */
#define FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_MASK                  (3 << FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_SHIFT)
#  define FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM(n)                  ((uint32_t)(n) << FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_SHIFT)

/* TIVA_FCFG1_PWD_CURR_20C */

#define FCFG1_PWD_CURR_20C_BASELINE_SHIFT                  (0)      /* Bits 0-7: Worst-case baseline maximum powerdown current, in units of 0.5uA */
#define FCFG1_PWD_CURR_20C_BASELINE_MASK                   (0xff << FCFG1_PWD_CURR_20C_BASELINE_SHIFT)
#  define FCFG1_PWD_CURR_20C_BASELINE(n)                   ((uint32_t)(n) << FCFG1_PWD_CURR_20C_BASELINE_SHIFT)
#define FCFG1_PWD_CURR_20C_DELTA_XOSC_LPM_SHIFT            (8)      /* Bits 8-15: Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode */
#define FCFG1_PWD_CURR_20C_DELTA_XOSC_LPM_MASK             (0xff << FCFG1_PWD_CURR_20C_DELTA_XOSC_LPM_SHIFT)
#  define FCFG1_PWD_CURR_20C_DELTA_XOSC_LPM(n)             ((uint32_t)(n) << FCFG1_PWD_CURR_20C_DELTA_XOSC_LPM_SHIFT)
#define FCFG1_PWD_CURR_20C_DELTA_RFMEM_RET_SHIFT           (16)      /* Bits 16-23: Additional maximum current, in 1uA units, with RF memory retention */
#define FCFG1_PWD_CURR_20C_DELTA_RFMEM_RET_MASK            (0xff << FCFG1_PWD_CURR_20C_DELTA_RFMEM_RET_SHIFT)
#  define FCFG1_PWD_CURR_20C_DELTA_RFMEM_RET(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_20C_DELTA_RFMEM_RET_SHIFT)
#define FCFG1_PWD_CURR_20C_DELTA_CACHE_REF_SHIFT           (24)      /* Bits 24-31: Additional maximum current, in units of 1uA, with cache retention */
#define FCFG1_PWD_CURR_20C_DELTA_CACHE_REF_MASK            (0xff << FCFG1_PWD_CURR_20C_DELTA_CACHE_REF_SHIFT)
#  define FCFG1_PWD_CURR_20C_DELTA_CACHE_REF(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_20C_DELTA_CACHE_REF_SHIFT)

