apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_fcfg1.h
#define FCFG1_PWD_CURR_110C_BASELINE_SHIFT                 (0)       /* Bits 0-7: Worst-case baseline maximum powerdown current, in units of 0.5uA */
#define FCFG1_PWD_CURR_110C_BASELINE_MASK                  (0xff << FCFG1_PWD_CURR_110C_BASELINE_SHIFT)
#  define FCFG1_PWD_CURR_110C_BASELINE(n)                  ((uint32_t)(n) << FCFG1_PWD_CURR_110C_BASELINE_SHIFT)
#define FCFG1_PWD_CURR_110C_DELTA_XOSC_LPM_SHIFT           (8)       /* Bits 8-15: Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode */
#define FCFG1_PWD_CURR_110C_DELTA_XOSC_LPM_MASK            (0xff << FCFG1_PWD_CURR_110C_DELTA_XOSC_LPM_SHIFT)
#  define FCFG1_PWD_CURR_110C_DELTA_XOSC_LPM(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_110C_DELTA_XOSC_LPM_SHIFT)
#define FCFG1_PWD_CURR_110C_DELTA_RFMEM_RET_SHIFT          (16)      /* Bits 16-23: Additional maximum current, in 1uA units, with RF memory retention */
#define FCFG1_PWD_CURR_110C_DELTA_RFMEM_RET_MASK           (0xff << FCFG1_PWD_CURR_110C_DELTA_RFMEM_RET_SHIFT)
#  define FCFG1_PWD_CURR_110C_DELTA_RFMEM_RET(n)           ((uint32_t)(n) << FCFG1_PWD_CURR_110C_DELTA_RFMEM_RET_SHIFT)
#define FCFG1_PWD_CURR_110C_DELTA_CACHE_REF_SHIFT          (24)      /* Bits 24-31: Additional maximum current, in units of 1uA, with cache retention */
#define FCFG1_PWD_CURR_110C_DELTA_CACHE_REF_MASK           (0xff << FCFG1_PWD_CURR_110C_DELTA_CACHE_REF_SHIFT)
#  define FCFG1_PWD_CURR_110C_DELTA_CACHE_REF(n)           ((uint32_t)(n) << FCFG1_PWD_CURR_110C_DELTA_CACHE_REF_SHIFT)

/* TIVA_FCFG1_PWD_CURR_125C */

#define FCFG1_PWD_CURR_125C_BASELINE_SHIFT                 (0)       /* Bits 0-7: Worst-case baseline maximum powerdown current, in units of 0.5uA */
#define FCFG1_PWD_CURR_125C_BASELINE_MASK                  (0xff << FCFG1_PWD_CURR_125C_BASELINE_SHIFT)
#  define FCFG1_PWD_CURR_125C_BASELINE(n)                  ((uint32_t)(n) << FCFG1_PWD_CURR_125C_BASELINE_SHIFT)
#define FCFG1_PWD_CURR_125C_DELTA_XOSC_LPM_SHIFT           (8)       /* Bits 8-15: Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode */
#define FCFG1_PWD_CURR_125C_DELTA_XOSC_LPM_MASK            (0xff << FCFG1_PWD_CURR_125C_DELTA_XOSC_LPM_SHIFT)
#  define FCFG1_PWD_CURR_125C_DELTA_XOSC_LPM(n)            ((uint32_t)(n) << FCFG1_PWD_CURR_125C_DELTA_XOSC_LPM_SHIFT)
#define FCFG1_PWD_CURR_125C_DELTA_RFMEM_RET_SHIFT          (16)      /* Bits 16-23: Additional maximum current, in 1uA units, with RF memory retention */
#define FCFG1_PWD_CURR_125C_DELTA_RFMEM_RET_MASK           (0xff << FCFG1_PWD_CURR_125C_DELTA_RFMEM_RET_SHIFT)
#  define FCFG1_PWD_CURR_125C_DELTA_RFMEM_RET(n)           ((uint32_t)(n) << FCFG1_PWD_CURR_125C_DELTA_RFMEM_RET_SHIFT)
#define FCFG1_PWD_CURR_125C_DELTA_CACHE_REF_SHIFT          (24)      /* Bits 24-31: Additional maximum current, in units of 1uA, with cache retention */
#define FCFG1_PWD_CURR_125C_DELTA_CACHE_REF_MASK           (0xff << FCFG1_PWD_CURR_125C_DELTA_CACHE_REF_SHIFT)
#  define FCFG1_PWD_CURR_125C_DELTA_CACHE_REF(n)           ((uint32_t)(n) << FCFG1_PWD_CURR_125C_DELTA_CACHE_REF_SHIFT)

/* TIVA_FCFG1_SHDW_DIE_ID_0 (32-bit value,  Shadow of DIE_ID_0 register in eFuse row number 5) */
/* TIVA_FCFG1_SHDW_DIE_ID_1 (32-bit value, Shadow of DIE_ID_1 register in eFuse row number 6) */
/* TIVA_FCFG1_SHDW_DIE_ID_2 (32-bit value, Shadow of DIE_ID_2 register in eFuse row number 7) */
/* TIVA_FCFG1_SHDW_DIE_ID_3 (32-bit value, Shadow of DIE_ID_3 register in eFuse row number 8) */

/* TIVA_FCFG1_SHDW_OSC_BIAS_LDO_TRIM */

#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM_SHIFT   (0)       /* Bits 0-7 */
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM_MASK    (0xff << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM_SHIFT)
#  define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM(n)    ((uint32_t)(n) << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM_SHIFT)
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE_SHIFT    (8)       /* Bits 8-11 */
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE_MASK     (15 << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE_SHIFT)
#  define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE(n)     ((uint32_t)(n) << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE_SHIFT)
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG_SHIFT       (12)      /* Bits 12-15 */
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG_MASK        (15 << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG_SHIFT)
#  define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG(n)        ((uint32_t)(n) << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG_SHIFT)
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO_SHIFT   (16)      /* Bits 16-17 */
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO_MASK    (3 << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO_SHIFT)
#  define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO(n)    ((uint32_t)(n) << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO_SHIFT)
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF_SHIFT        (18)      /* Bits 18-22 */
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF_MASK         (31 << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF_SHIFT)
#  define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF(n)         ((uint32_t)(n) << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF_SHIFT)
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG_SHIFT         (23)      /* Bits 23-26 */
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG_MASK          (15 << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG_SHIFT)
#  define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG(n)          ((uint32_t)(n) << FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG_SHIFT)

/* TIVA_FCFG1_SHDW_ANA_TRIM */

#define FCFG1_SHDW_ANA_TRIM_TRIMTEMP_SHIFT                 (0)       /* Bits 0-5 */
#define FCFG1_SHDW_ANA_TRIM_TRIMTEMP_MASK                  (0x3f << FCFG1_SHDW_ANA_TRIM_TRIMTEMP_SHIFT)
#  define FCFG1_SHDW_ANA_TRIM_TRIMTEMP(n)                  ((uint32_t)(n) << FCFG1_SHDW_ANA_TRIM_TRIMTEMP_SHIFT)
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_EXTMODE_SHIFT          (6)       /* Bits 6-10 */
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_EXTMODE_MASK           (0x1f << FCFG1_SHDW_ANA_TRIM_TRIMBOD_EXTMODE_SHIFT)
#  define FCFG1_SHDW_ANA_TRIM_TRIMBOD_EXTMODE(n)           ((uint32_t)(n) << FCFG1_SHDW_ANA_TRIM_TRIMBOD_EXTMODE_SHIFT)
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_INTMODE_SHIFT          (11)      /* Bits 11-15 */
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_INTMODE_MASK           (31 << FCFG1_SHDW_ANA_TRIM_TRIMBOD_INTMODE_SHIFT)
#  define FCFG1_SHDW_ANA_TRIM_TRIMBOD_INTMODE(n)           ((uint32_t)(n) << FCFG1_SHDW_ANA_TRIM_TRIMBOD_INTMODE_SHIFT)
#define FCFG1_SHDW_ANA_TRIM_VDDR_TRIM_SHIFT                (16)      /* Bits 16-20 */
#define FCFG1_SHDW_ANA_TRIM_VDDR_TRIM_MASK                 (31 << FCFG1_SHDW_ANA_TRIM_VDDR_TRIM_SHIFT)
#  define FCFG1_SHDW_ANA_TRIM_VDDR_TRIM(n)                 ((uint32_t)(n) << FCFG1_SHDW_ANA_TRIM_VDDR_TRIM_SHIFT)
#define FCFG1_SHDW_ANA_TRIM_IPTAT_TRIM_SHIFT               (21)      /* Bits 21-22 */
#define FCFG1_SHDW_ANA_TRIM_IPTAT_TRIM_MASK                (3 << FCFG1_SHDW_ANA_TRIM_IPTAT_TRIM_SHIFT)
#  define FCFG1_SHDW_ANA_TRIM_IPTAT_TRIM(n)                ((uint32_t)(n) << FCFG1_SHDW_ANA_TRIM_IPTAT_TRIM_SHIFT)
#define FCFG1_SHDW_ANA_TRIM_VDDR_OK_HYS                    (1 << 23) /* Bit 23 */
#define FCFG1_SHDW_ANA_TRIM_VDDR_ENABLE_PG1                (1 << 24) /* Bit 24 */
#define FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_SHIFT     (25)      /* Bits 25-26 */
#define FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_MASK      (3 << FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_SHIFT)
#  define FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF(n)      ((uint32_t)(n) << FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_SHIFT)

/* TIVA_FCFG1_DAC_BIAS_CNF */

#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_BACKUP_EN              (1 << 8)  /* Bit 8 */
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_WIDTH_TRIM_SHIFT       (9)      /* Bits 9-11 */
#define FCFG1_DAC_BIAS_CNF_LPM_BIAS_WIDTH_TRIM_MASK        (7 << FCFG1_DAC_BIAS_CNF_LPM_BIAS_WIDTH_TRIM_SHIFT)
#  define FCFG1_DAC_BIAS_CNF_LPM_BIAS_WIDTH_TRIM(n)        ((uint32_t)(n) << FCFG1_DAC_BIAS_CNF_LPM_BIAS_WIDTH_TRIM_SHIFT)
#define FCFG1_DAC_BIAS_CNF_LPM_TRIM_IOUT_SHIFT             (12)      /* Bits 12-17 */
#define FCFG1_DAC_BIAS_CNF_LPM_TRIM_IOUT_MASK              (0x3f << FCFG1_DAC_BIAS_CNF_LPM_TRIM_IOUT_SHIFT)
#  define FCFG1_DAC_BIAS_CNF_LPM_TRIM_IOUT(n)              ((uint32_t)(n) << FCFG1_DAC_BIAS_CNF_LPM_TRIM_IOUT_SHIFT)

