apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_fcfg1.h
/* TIVA_FCFG1_TFW_PROBE (32-bit value) */
/* TIVA_FCFG1_TFW_FT (32-bit value) */

/* TIVA_FCFG1_DAC_CAL0 */

#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C1_SHIFT  (0)      /* Bits 0-15 */
#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C1_MASK   (0xffff << FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C1_SHIFT)
#  define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C1(n)   ((uint32_t)(n) << FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C1_SHIFT)
#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C2_SHIFT  (16)      /* Bits 16-31 */
#define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C2_MASK   (0xffff << FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C2_SHIFT)
#  define FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C2(n)   ((uint32_t)(n) << FCFG1_DAC_CAL0_SOC_DAC_VOUT_CAL_DECOUPLE_C2_SHIFT)

/* TIVA_FCFG1_DAC_CAL1 */

#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C1_SHIFT     (0)      /* Bits 0-15 */
#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C1_MASK      (0xffff << FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C1_SHIFT)
#  define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C1(n)      ((uint32_t)(n) << FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C1_SHIFT)
#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C2_SHIFT     (16)      /* Bits 16-31 */
#define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C2_MASK      (0xffff << FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C2_SHIFT)
#  define FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C2(n)      ((uint32_t)(n) << FCFG1_DAC_CAL1_SOC_DAC_VOUT_CAL_PRECH_C2_SHIFT)

/* TIVA_FCFG1_DAC_CAL2 */

#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C1_SHIFT    (0)      /* Bits 0-15 */
#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C1_MASK     (0xffff << FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C1_SHIFT)
#  define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C1(n)     ((uint32_t)(n) << FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C1_SHIFT)
#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C2_SHIFT    (16)      /* Bits 16-31 */
#define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C2_MASK     (x0xffffx << FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C2_SHIFT)
#  define FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C2(n)     ((uint32_t)(n) << FCFG1_DAC_CAL2_SOC_DAC_VOUT_CAL_ADCREF_C2_SHIFT)

/* TIVA_FCFG1_DAC_CAL3 */

#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C1_SHIFT      (0)      /* Bits 0-15 */
#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C1_MASK       (0xffff << FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C1_SHIFT)
#  define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C1(n)       ((uint32_t)(n) << FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C1_SHIFT)
#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C2_SHIFT      (16)      /* Bits 16-31 */
#define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C2_MASK       (0xffff << FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C2_SHIFT)
#  define FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C2(n)       ((uint32_t)(n) << FCFG1_DAC_CAL3_SOC_DAC_VOUT_CAL_VDDS_C2_SHIFT)

#endif /* __ARCH_ARM_SRC_TIVA_HARDWARE_CC13X2_CC26X2_CC13X2_CC26X2_FCFG1_H */
